{
  "basics": {
    "name": "Ujjwal Ojha",
    "picture": "",
    "email": "me@ujjwalojha.com.np",
    "phone": "+61411440539",
    "summary": "I am a Product-Minded Software Engineer who is extremely passionate about providing value while designing systems with long-term vision in mind."
  },
  "profiles": [
    {
      "network": "Github",
      "username": "ojhaujjwal",
      "url": "https://github.com/ojhaujjwal"
    },
    {
      "network": "Medium",
      "username": "ojhaujjwal",
      "url": "https://medium.com/@ojhaujjwal"
    },
    {
      "network": "Linkedin",
      "username": "ujjwal-ojha",
      "url": "https://www.linkedin.com/in/ujjwal-ojha"
    }
  ],
  "work": [
    {
      "company": "Shippit",
      "position": "Senior Software Engineer",
      "website": "https://www.shippit.com/",
      "startDate": "2021-09-15",
      "summary": "Solving challenging problems in courier/shipping industry using technology",
      "highlights": [
       "Lead and deliver multiple big releases of a new cutting-edge courier recommendation project in the shipping industry",
       "Team up with PM and UX to strategize new revenue-generating features while also improving the scalability of the existing system",
       "Performed critical upgrades/migrations of existing systems to new technologies with close to zero downtime",
       "Designing and architecturing system (based on microservices) for complex business requirements while also mentoring junior enginers on best practices",
       "Improve observability/monitoring capabilities of existing system to eliminate downtime/broken features in production",
       "Influence the whole engineering team to adopt new frontend monitoring capabilities for monitoring deployment and feature flag rollout"
      ]
    },
    {
      "company": "The Iconic",
      "position": "Software Engineer",
      "website": "https://theiconic.com.au/",
      "startDate": "2019-04-09",
      "endDate": "2021-09-14",
      "summary": "Working as a Software Engineer mostly on Microservices architecture.",
      "highlights": [
        "Migrated 7 million users from one CRM to another with low hiccups.",
        "Migrated millions of products from one Image Recognition system to another system while powering Visually Similar Products feature",
        "Discovered new product feature to increase ABV and did A/B testing to validate the hypothesis successfully.",
        "Revamp and re-design a very old Tax Invoice PDF generation system to new design following all compliance requirements.",
        "Re-engineer PHP and Node microservices to handle more traffic.",
        "Introduce Domain Driven Design and CQRS to architecture a new php based microservice.",
        "Being a part of on-call team roaster responsbile for co-ordinating issues, troubleshooting outages and preparing incident reports for website outages.",
        "Automate end-to-end CI build process and deployment for new services in kubernetes."
      ]
    },
    {
      "company": "Logpoint",
      "position": "Software Engineer",
      "website": "http://logpoint.com/",
      "startDate": "2017-10-03",
      "endDate": "2019-03-29",
      "summary": "Worked on distributed system for Managed security service provider (MSSP).",
      "highlights": [
        "Interacted with other team of developers for API compatibility and smoothly develop new features maintaining compatibility.",
        "Engineer an event based system to scale the distributed system of MSSP asynchronously.",
        "Engineer a system for MSSP to be able to handle multiple version of a SIEM system.",
        "Making use of background job scaling tool like RabbitMQ to design certain features."
      ]
    },
    {
      "company": "IntroCept Nepal",
      "position": "Software Engineer",
      "website": "",
      "startDate": "2016-08-22",
      "endDate": "2017-09-26",
      "summary": "Architectured a distributed web application system(SaaS). Lead a team of developers together to deliver business goals. Practice continuous delivery and Agile to deliver software as quickly as possible to the end user.",
      "highlights": [
        "Automate microservices deployment to build scalable SaaS systems.",
        "Formulate a plan to refactor a legacy system using old technologies to new technologies and implemented it in a running system.",
        "Create internal systems for smoothening/simplifying internal processes."
      ]
    },
    {
      "company": "Yiwii LLC",
      "position": "Software Engineer",
      "website": "",
      "startDate": "2015-08-04",
      "endDate": "2016-08-19",
      "summary": "I worked as a Software Engineer on multiple freelance projects.",
      "highlights": [
        "Developing REST APIs and Single Page application to power sports match scheduling system.",
        "Incorporate software best practices to create maintainable systems.",
        "Perform optimizations in backend to reduce application response time and reduce server cost in higher traffic."
      ]
    },
    {
      "company": "Hrevert Technologies",
      "position": "Software Developer",
      "website": "http://hrevert.com",
      "startDate": "2013-05-15",
      "endDate": "2015-08-01",
      "summary": "I worked mostly on PHP backends and maintained basic production servers.",
      "highlights": [
        "Created a energy management and monitoring system for monitoring energy consumption/production by integrating to energy meters.",
        "Worked on project management system to create projects and divide them to tasks and assign them to employees."
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Tribhuvan University",
      "area": "Kathmandu",
      "studyType": "Bachelor of Science in Computer Science and Information Technology",
      "startDate": "2013-10-01",
      "endDate": "2017-12-20",
      "courses": []
    }
  ],
  "awards": [],
  "publications": [],
  "skills": [
    {
      "name": "Languages",
      "level": "",
      "keywords": [ "TypeScript/JavaScript", "Node", "React", "PHP", "Ruby", "Python" ]
    },
    {
      "name": "Ops",
      "level": "",
      "keywords": [ "Docker", "DevOps", "SRE", "Terraform", "Kurbernetes", "GCP" ]
    }
  ],
  "references": []
}
